CSI API ETABS v1
cDatabaseTables.ShowTablesInExcel Method
 Exports the specified tables to Excel.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int ShowTablesInExcel(
	ref string[] TableKeyList,
	int WindowHandle
)
Function ShowTablesInExcel (
	ByRef TableKeyList As String(),
	WindowHandle As Integer
) As Integer
Dim instance As cDatabaseTables
Dim TableKeyList As String()
Dim WindowHandle As Integer
Dim returnValue As Integer
returnValue = instance.ShowTablesInExcel(TableKeyList,
	WindowHandle)
int ShowTablesInExcel(
	array<String^>^% TableKeyList,
	int WindowHandle
)
abstract ShowTablesInExcel :
        TableKeyList : string[] byref *
        WindowHandle : int -> int
Parameters
TableKeyList
Type: System.String[]
A zero-based array of the table keys for the tables to be included in the output.
WindowHandle
Type: System.Int32
If a valid window handle is entered here Excel will be located in front of that window.
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
Remarks
 Excel must be present on the computer for this function to work. If there is nothing to be shown in the table then no data is returned and Excel is not displayed.
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace